print("Ιστορία: Το Μυστικό του Βουνού")

print("Η Αράξια, μια νεαρή Αρμένισσα που μεγάλωσε στη Ματσούκα, βρίσκει ένα παλιό χειρόγραφο που αναφέρει έναν ξεχασμένο ναό στα βουνά του Πόντου.\nΛέγεται ότι εκεί ενώθηκαν κάποτε οι λαοί της περιοχής για να κρύψουν ένα πανίσχυρο αντικείμενο – την Καρδιά του Ορούτ, μια πέτρα που ενώνει μνήμες και γλώσσες.\nΟ φίλος της, ο Σταύρος, Πόντιος μουσικός, αποφασίζει να τη βοηθήσει να φτάσει εκεί. Καθώς φεύγουν από το χωριό, η ομίχλη πέφτει βαριά και βρίσκονται σε ένα σταυροδρόμι στο δάσος...")

print("Η Αράξια κοιτάζει τον Σταύρο.\n«Αν πάμε δεξιά, θα φτάσουμε πιο γρήγορα, αλλά λένε ότι είναι στοιχειωμένο.\nΑν πάμε αριστερά, θα περάσουμε από ένα παλιό αρμενικό χωριό...»")

q1 = input("Τι πρέπει να κάνουν;\n1) Πάνε δεξιά, μέσα από το στοιχειωμένο μονοπάτι\n2) Πάνε αριστερά, μέσα από το εγκαταλελειμμένο χωριό\n 3) Στήνουν κατασκήνωση και περιμένουν να ξημερώσει\n:")

if q1 == "1":
    print("Η Αράξια και ο Σταύρος προχωρούν μέσα στο στοιχειωμένο δάσος.\nΗ ομίχλη πυκνώνει. Ξαφνικά, βλέπουν μια μαυροντυμένη φιγούρα. Δεν τους επιτίθεται – τους κάνει μια ερώτηση:")
    q2 = input("«Αν θέλετε να συνεχίσετε, απαντήστε:\nΤι ενώνει περισσότερο τους λαούς;\n1) Το χρήμα\n2) Η γνώση\n3) Η μουσική»")
    if q2 == "3":
        print("Σωστη απαντηση...\nΤο παινχιδι θα συνεχίσει να φτιαχνετε ευχαριστουμε που παιξατε το demo")
    else:
        print("Χάνεις – Η φιγούρα εξαφανίζεται και χάνεστε στην ομίχλη.")
elif q1 == "2":
    print("Περνούν από τα ερείπια. Σε έναν τοίχο βρίσκουν σκαλισμένα αρμενικά γράμματα.\nΗ Αράξια τα διαβάζει:Το παρελθόν είναι βαρύ, αλλά... η καρδιά;»Ξαφνικά, από τα ερείπια βγαίνει μια φωτεινή μορφή – σαν προστάτης.")
    q3 = input("«Για να περάσετε, απαντήστε:Ποια είναι η γλώσσα που δεν χρειάζεται μετάφραση;»\n1) Ο φόβος\n2) Η αγάπη\n3) Η ιστορία\n:")
    if q3 == "2":
        print("Σωστη απαντηση...\nΤο παινχιδι θα συνεχίσει να φτιαχνετε ευχαριστουμε που παιξατε το demo")
    else:
        print("Χάνεις – η μορφή χάνεται, ο δρόμος γκρεμίζεται.")
elif q1 == "3":
    print("Στήνουν κατασκήνωση.\nΣτη μέση της νύχτας ακούνε μια φωνή από το δάσος:")
    q4 = input("«Μείνατε πίσω. Τώρα απαντήστε:Τι πρέπει να κάνει κάποιος όταν δεν ξέρει τον δρόμο;»\n1) Να συνεχίσει στα τυφλά\n2) Να περιμένει βοήθεια\n3) Να ρωτήσει τον άλλο\n:")
    if q4 == "3":
        print("Σωστη απαντηση...\nΤο παινχιδι θα συνεχίσει να φτιαχνετε ευχαριστουμε που παιξατε το demo")
    else:
        print("Χανεις - Παγιδεύονται – το δάσος κλείνει γύρω τους.")
